FBTUG/FBTUG_MiniFarmBot/EDU/S4F/S4F.20200205.1/ESP32CAM_UDP_TTL0/app_httpd.cpp
    aligned_face = dl_matrix3du_alloc(1, FACE_WIDTH, FACE_HEIGHT, 3);
    if(!aligned_face){
        #ifdef Serial_DEBUG
          Serial.println("Could not allocate face recognition buffer");
        #endif          
        return matched_id;
    }
    
    if (align_face(net_boxes, image_matrix, aligned_face) == ESP_OK){
        if (is_enrolling == 1){
            int8_t left_sample_face = enroll_face(&id_list, aligned_face);

            if(left_sample_face == (ENROLL_CONFIRM_TIMES - 1)){
                #ifdef Serial_DEBUG
                  Serial.printf("Enrolling Face ID: %d\n", id_list.tail);
                #endif  
            }
            #ifdef Serial_DEBUG
              Serial.printf("Enrolling Face ID: %d sample %d\n", id_list.tail, ENROLL_CONFIRM_TIMES - left_sample_face);
            #endif  
            rgb_printf(image_matrix, FACE_COLOR_CYAN, "ID[%u] Sample[%u]", id_list.tail, ENROLL_CONFIRM_TIMES - left_sample_face);
            if (left_sample_face == 0){
                is_enrolling = 0;
                #ifdef Serial_DEBUG
                  Serial.printf("Enrolled Face ID: %d\n", id_list.tail);
                #endif  
            }
        } 
        else {
            matched_id = recognize_face(&id_list, aligned_face);
            if (matched_id >= 0) {
                #ifdef Serial_DEBUG
                  Serial.printf("Match Face ID: %u\n", matched_id);
                #endif  
                rgb_printf(image_matrix, FACE_COLOR_GREEN, "Hello Subject %u", matched_id);
            } 
            else {
                #ifdef Serial_DEBUG
                  Serial.println("No Match Found");
                #endif  
                rgb_print(image_matrix, FACE_COLOR_RED, "Intruder Alert!");
                matched_id = -1;
            }
        }
    } 
    else {
        #ifdef Serial_DEBUG
          Serial.println("Face Not Aligned");
        #endif          
        //rgb_print(image_matrix, FACE_COLOR_YELLOW, "Human Detected");
    }

    dl_matrix3du_free(aligned_face);
    
    return matched_id;
}

//---------------------------------------------------------------------------------------------
static size_t jpg_encode_stream(void * arg, size_t index, const void* data, size_t len){
    jpg_chunking_t *j = (jpg_chunking_t *)arg;
    
    if(!index){
        j->len = 0;
    }
    
    if(httpd_resp_send_chunk(j->req, (const char *)data, len) != ESP_OK){
        return 0;
    }
    
    j->len += len;
    
    return len;
}

//---------------------------------------------------------------------------------------------
static esp_err_t capture_handler(httpd_req_t *req){
//camera_fb_t * fb = NULL;
    
    fb = NULL;
    esp_err_t res = ESP_OK;
    
    int64_t fr_start = esp_timer_get_time();

    fb = esp_camera_fb_get();
    if (!fb) {
        #ifdef Serial_DEBUG
          Serial.println("Camera capture failed");
        #endif  
        httpd_resp_send_500(req);
        return ESP_FAIL;
    }

    //replace this with your own function
    //process_image(fb->width, fb->height, fb->format, fb->buf, fb->len);
    
    httpd_resp_set_type(req, "image/jpeg");
    httpd_resp_set_hdr(req, "Content-Disposition", "inline; filename=capture.jpg");
    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");    //109.01.26-補上

    size_t out_len, out_width, out_height;
    uint8_t * out_buf;
    bool s;
    
    bool detected = false;
    int face_id = 0;

    if(!detection_enabled || fb->width > 400){      
        size_t fb_len = 0;
        if(fb->format == PIXFORMAT_JPEG){
            fb_len = fb->len;
            res = httpd_resp_send(req, (const char *)fb->buf, fb->len);
        } 
        else {
            jpg_chunking_t jchunk = {req, 0};
            res = frame2jpg_cb(fb, 80, jpg_encode_stream, &jchunk) ? ESP_OK:ESP_FAIL;
            httpd_resp_send_chunk(req, NULL, 0);
            fb_len = jchunk.len;
        }
        
        esp_camera_fb_return(fb);

        #ifdef Serial_DEBUG 
          int64_t fr_end = esp_timer_get_time();
          Serial.printf("JPG: %uB %ums\n", (uint32_t)(fb_len), (uint32_t)((fr_end - fr_start) / 1000));
        #endif 

        return res;
    }

    //--------------------------------------------------------------
    dl_matrix3du_t *image_matrix = dl_matrix3du_alloc(1, fb->width, fb->height, 3);
    if (!image_matrix) {
        esp_camera_fb_return(fb);
        #ifdef Serial_DEBUG
          Serial.println("dl_matrix3du_alloc failed");
        #endif   
        httpd_resp_send_500(req);
        
        return ESP_FAIL;
    }

    out_buf = image_matrix->item;
    out_len = fb->width * fb->height * 3;
    out_width = fb->width;
    out_height = fb->height;

    s = fmt2rgb888(fb->buf, fb->len, fb->format, out_buf);
    esp_camera_fb_return(fb);
    if(!s){
        dl_matrix3du_free(image_matrix);
        #ifdef Serial_DEBUG
          Serial.println("to rgb888 failed");
        #endif  
        httpd_resp_send_500(req);
        
        return ESP_FAIL;
    }

    if(detection_enabled){    //-109.01.27
        box_array_t *net_boxes = face_detect(image_matrix, &mtmn_config);
        if (net_boxes){
            detected = true;
            if(recognition_enabled){
                face_id = run_face_recognition(image_matrix, net_boxes);
            }
            
            draw_face_boxes(image_matrix, net_boxes, face_id);
    
            free(net_boxes->score);   //-109.01.26-補上
            free(net_boxes->box);
            free(net_boxes->landmark);
            free(net_boxes);
        }
    }
    
    jpg_chunking_t jchunk = {req, 0};
    s = fmt2jpg_cb(out_buf, out_len, out_width, out_height, PIXFORMAT_RGB888, 90, jpg_encode_stream, &jchunk);
    dl_matrix3du_free(image_matrix);
    if(!s){
        #ifdef Serial_DEBUG
          Serial.println("JPEG compression failed");
        #endif  
        return ESP_FAIL;
    }

    #ifdef Serial_DEBUG 
      int64_t fr_end = esp_timer_get_time();
      if(detection_enabled){    //-109.01.27
          Serial.printf("FACE: %uB %ums %s%d\n", (uint32_t)(jchunk.len), (uint32_t)((fr_end - fr_start) / 1000), detected?"DETECTED ":"", face_id);
      }
    #endif 

    return res;
}

//---------------------------------------------------------------------------------------------
static esp_err_t stream_handler(httpd_req_t *req){
//camera_fb_t * fb = NULL;
esp_err_t res = ESP_OK;
size_t _jpg_buf_len = 0;
uint8_t * _jpg_buf = NULL;
char * part_buf[64];
dl_matrix3du_t *image_matrix = NULL;

//-------------------------
bool detected = false;
int face_id = 0;

int64_t fr_start = 0;
int64_t fr_ready = 0;
int64_t fr_face = 0;
int64_t fr_recognize = 0;
int64_t fr_encode = 0;

//-------------------------
static int64_t last_frame = 0;

