FBTUG/FBTUG_MiniFarmBot/EDU/S4F/S4F.20200205.1/ESP32CAM_UDP_TTL0/app_httpd.cpp
    fb = NULL;
    res = ESP_OK;   //-109.02.03

    if(!last_frame) {
        last_frame = esp_timer_get_time();
    }

    res = httpd_resp_set_type(req, _STREAM_CONTENT_TYPE);
    if(res != ESP_OK){
        return res;
    }

    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");

    while(true){
        detected = false;
        face_id = 0;
        
        fb = esp_camera_fb_get();
        if (!fb) {
            #ifdef Serial_DEBUG
              Serial.println("Camera capture failed");
            #endif  
            res = ESP_FAIL;
        } 
        else {
            fr_start = esp_timer_get_time();
            fr_ready = fr_start;
            fr_face = fr_start;
            fr_encode = fr_start;
            fr_recognize = fr_start;
            
            if(!detection_enabled || fb->width > 400){
                if(fb->format != PIXFORMAT_JPEG){
                    bool jpeg_converted = frame2jpg(fb, 80, &_jpg_buf, &_jpg_buf_len);
                    esp_camera_fb_return(fb);
                    fb = NULL;
                    if(!jpeg_converted){
                        #ifdef Serial_DEBUG
                          Serial.println("JPEG compression failed");
                        #endif   
                        res = ESP_FAIL;
                    }
                } 
                else {
                    _jpg_buf_len = fb->len;
                    _jpg_buf = fb->buf;
                }
            } 
            else{   // detection_enabled
                image_matrix = dl_matrix3du_alloc(1, fb->width, fb->height, 3);

                if (!image_matrix) {
                    #ifdef Serial_DEBUG
                      Serial.println("dl_matrix3du_alloc failed");
                    #endif  
                    res = ESP_FAIL;
                } 
                else {
                    if(!fmt2rgb888(fb->buf, fb->len, fb->format, image_matrix->item)){
                        #ifdef Serial_DEBUG
                          Serial.println("fmt2rgb888 failed");
                        #endif  
                        res = ESP_FAIL;
                    } 
                    else {
                        fr_ready = esp_timer_get_time();
                        box_array_t *net_boxes = NULL;
                        if(detection_enabled){
                            net_boxes = face_detect(image_matrix, &mtmn_config);
                        }
                        
                        fr_face = esp_timer_get_time();
                        fr_recognize = fr_face;
                        if (net_boxes || fb->format != PIXFORMAT_JPEG){
                            if(net_boxes){
                                detected = true;
                                if(recognition_enabled){
                                    face_id = run_face_recognition(image_matrix, net_boxes);
                                }
                                
                                fr_recognize = esp_timer_get_time();
                                draw_face_boxes(image_matrix, net_boxes, face_id);

                                free(net_boxes->score);
                                free(net_boxes->box);
                                free(net_boxes->landmark);
                                free(net_boxes);
                            }
                            
                            if(!fmt2jpg(image_matrix->item, fb->width * fb->height * 3, fb->width, fb->height, PIXFORMAT_RGB888, 90, &_jpg_buf, &_jpg_buf_len)){
                                #ifdef Serial_DEBUG
                                  Serial.println("fmt2jpg failed");
                                #endif  
                                res = ESP_FAIL;
                            }
                            esp_camera_fb_return(fb);
                            fb = NULL;
                        }
                        else {
                            _jpg_buf = fb->buf;
                            _jpg_buf_len = fb->len;
                        }
                        fr_encode = esp_timer_get_time();
                    }
                    dl_matrix3du_free(image_matrix);
                }
            }
        }

        //------------------------------------------------------
        if(res == ESP_OK){
            size_t hlen = snprintf((char *)part_buf, 64, _STREAM_PART, _jpg_buf_len);
            res = httpd_resp_send_chunk(req, (const char *)part_buf, hlen);
        }
        
        if(res == ESP_OK){
            res = httpd_resp_send_chunk(req, (const char *)_jpg_buf, _jpg_buf_len);
        }
        
        if(res == ESP_OK){
            res = httpd_resp_send_chunk(req, _STREAM_BOUNDARY, strlen(_STREAM_BOUNDARY));
        }
        
        if(fb){
            esp_camera_fb_return(fb);
            
            fb = NULL;
            _jpg_buf = NULL;
        } 
        else if(_jpg_buf){
            free(_jpg_buf);
            _jpg_buf = NULL;
        }
        if(res != ESP_OK){
            break;
        }
   
        #ifdef Serial_DEBUG      
          int64_t fr_end = esp_timer_get_time();
          int64_t frame_time = fr_end - last_frame;         
          frame_time /= 1000;      
          last_frame = fr_end;
  
          //-----------------------------------------------------------------------------------
          if(detection_enabled){    //-109.01.27
              int64_t ready_time = (fr_ready - fr_start) / 1000;
              int64_t face_time = (fr_face - fr_ready) / 1000;
              int64_t recognize_time = (fr_recognize - fr_face) /1000;
              int64_t encode_time = (fr_encode - fr_recognize) / 1000;
              int64_t process_time = (fr_encode - fr_start) / 1000;   
                    
              uint32_t avg_frame_time = ra_filter_run(&ra_filter, frame_time);
              
              Serial.printf("MJPG: %uB %ums (%.1ffps), AVG: %ums (%.1ffps), %u+%u+%u+%u=%u %s%d\n",
                  (uint32_t)(_jpg_buf_len),
                  (uint32_t)frame_time, 1000.0 / (uint32_t)frame_time,
                  
                  avg_frame_time, 1000.0 / avg_frame_time,
                  (uint32_t)ready_time, (uint32_t)face_time, (uint32_t)recognize_time, (uint32_t)encode_time, (uint32_t)process_time,
                  (detected) ? "DETECTED " : "", face_id);
          }
          else{
              Serial.printf("MJPG: %uB %ums (%.1ffps)\n",
                  (uint32_t)(_jpg_buf_len),
                  (uint32_t)frame_time, 1000.0 / (uint32_t)frame_time);
          }               
        #endif     
    }

    last_frame = 0;
    
    return res;
}

//---------------------------------------------------------------------------------------------
static esp_err_t cmd_handler(httpd_req_t *req){
char*  buf;
size_t buf_len;
char variable[32] = {0,};
char value[32] = {0,};

    buf_len = httpd_req_get_url_query_len(req) + 1;
    if (buf_len > 1) {
        buf = (char*)malloc(buf_len);
        if(!buf){
            httpd_resp_send_500(req);
            return ESP_FAIL;
        }
        
