FBTUG/FBTUG_MiniFarmBot/EDU/S4F/S4F.20200205.1/ESP32CAM_UDP_TTL0/app_httpd.cpp
            input[type=range]:focus::-ms-fill-upper {
                background: #363636
            }

            .switch {
                display: block;
                position: relative;
                line-height: 22px;
                font-size: 16px;
                height: 22px
            }

            .switch input {
                outline: 0;
                opacity: 0;
                width: 0;
                height: 0
            }

            .slider {
                width: 50px;
                height: 22px;
                border-radius: 22px;
                cursor: pointer;
                background-color: grey
            }

            .slider,.slider:before {
                display: inline-block;
                transition: .4s
            }

            .slider:before {
                position: relative;
                content: "";
                border-radius: 50%;
                height: 16px;
                width: 16px;
                left: 4px;
                top: 3px;
                background-color: #fff
            }

            input:checked+.slider {
                background-color: #ff3034
            }

            input:checked+.slider:before {
                -webkit-transform: translateX(26px);
                transform: translateX(26px)
            }

            select {
                border: 1px solid #363636;
                font-size: 14px;
                height: 22px;
                outline: 0;
                border-radius: 5px
            }

            .image-container {
                position: relative;
                min-width: 160px
            }

            .close {
                position: absolute;
                right: 5px;
                top: 5px;
                background: #ff3034;
                width: 16px;
                height: 16px;
                border-radius: 100px;
                color: #fff;
                text-align: center;
                line-height: 18px;
                cursor: pointer
            }

            .hidden {
                display: none
            }
        </style>

    </head>
    <body onload="document.getElementById('ip').value=location.origin;">
    
    <figure>
      <div id="stream-container" class="image-container hidden">
        <div class="close" id="close-stream">×</div>
        <img id="stream" src="">   

        <canvas id="canvas" width="320" height="240" style="background-color:#000000; display:none;">
        <img id="example" width="320" height="240" style="display:none">            
      </div>
    </figure>
    
        <section class="main">
            <section id="buttons">
                <table>
                  <tr><td colspan="3">IP: <input type="text" id="ip" value=""></td></tr>
                  
                  <tr><td><button id="get-still">拍照</button></td>
                      <td><button id="toggle-stream">動態影像</button></td>
                      <td><button id="face_enroll" class="disabled" disabled="disabled">臉像登錄</button></td></tr>                                                                          
                  
                  <tr><td>閃光燈</td><td colspan="2"><input type="range" id="flash" min="0" max="255" value="0" onchange="
                  try{
                    fetch(document.getElementById('ip').value+'/control?var=flash&val='+this.value);
                  }
                  catch(e){}"></td></tr>

                  <tr><td>XY-速度</td><td colspan="2"><input type="range" id="speedL" min="0" max="255" value="255" onchange="
                  try{
                    fetch(document.getElementById('ip').value+'/control?var=speedL&val='+this.value);
                  }
                  catch(e){}"></td></tr>
                                    
                  <tr><td> Z-速度</td><td colspan="2"><input type="range" id="speedR" min="0" max="255" value="255" onchange="
                  try{
                    fetch(document.getElementById('ip').value+'/control?var=speedR&val='+this.value);
                  }
                  catch(e){}"></td></tr>
                 
                  <!--LF-F-RF-->
                  <tr><td align="center"><button onmousedown="
                  try{
                    fetch(document.getElementById('ip').value+'/control?var=car&val=6');
                  }
                  catch(e){}" 
                  onmouseup="noStopControl();" ontouchstart="event.preventDefault();
                  try{
                    fetch(document.getElementById('ip').value+'/control?var=car&val=6');
                  }
                  catch(e){}"                     
                  ontouchend="noStopControl();">[    左-前     ]</button></td>
                  
                  <td align="center"><button onmousedown="
                  try{
                    fetch(document.getElementById('ip').value+'/control?var=car&val=1');
                  }
                  catch(e){}"  
                  onmouseup="noStopControl();" ontouchstart="event.preventDefault();
                  try{
                    fetch(document.getElementById('ip').value+'/control?var=car&val=1');
                  }
                  catch(e){}"                              
                  ontouchend="noStopControl();">[      前      ]</button></td>
                  
                  <td align="center"><button onmousedown="
                  try{
                    fetch(document.getElementById('ip').value+'/control?var=car&val=7');
                  }
                  catch(e){}" 
                  onmouseup="noStopControl();" ontouchstart="event.preventDefault();
                  try{
                    fetch(document.getElementById('ip').value+'/control?var=car&val=7');
                  }
                  catch(e){}"                   
                  ontouchend="noStopControl();">[    右-前     ]</button></td></tr>

                  <!--L-S-R-->
                  <tr><td align="center"><button onmousedown="
                  try{
                    fetch(document.getElementById('ip').value+'/control?var=car&val=2');
                  }
                  catch(e){}" 
                  onmouseup="noStopControl();" ontouchstart="event.preventDefault();
                  try{
                    fetch(document.getElementById('ip').value+'/control?var=car&val=2');
                  }
                  catch(e){}"                    
                  ontouchend="noStopControl();">[      左      ]</button></td>
                  
                  <td align="center"><button onclick="
                  try{
                    fetch(document.getElementById('ip').value+'/control?var=car&val=3');
                  }           
                  catch(e){}">[      停      ]</button></td>
                  
                  <td align="center"><button onmousedown="
                  try{
                    fetch(document.getElementById('ip').value+'/control?var=car&val=4');
                  }
                  catch(e){}"    
                  onmouseup="noStopControl();" ontouchstart="event.preventDefault();
                  try{
                    fetch(document.getElementById('ip').value+'/control?var=car&val=4');
                  }
                  catch(e){}"                   
                  ontouchend="noStopControl();">[      右      ]</button></td></tr>
                  
                  <!--LB-B-RB-->
                  <tr><td align="center"><button onmousedown="
                  try{
                    fetch(document.getElementById('ip').value+'/control?var=car&val=8');
                  }
                  catch(e){}" 
                  onmouseup="noStopControl();" ontouchstart="event.preventDefault();
                  try{
                    fetch(document.getElementById('ip').value+'/control?var=car&val=8');
                  }
                  catch(e){}"                   
                  ontouchend="noStopControl();">[    左-後     ]</button></td>
                  
                  <td align="center"><button onmousedown="
                  try{
                    fetch(document.getElementById('ip').value+'/control?var=car&val=5');
                  }
                  catch(e){}"                  
                  onmouseup="noStopControl();" ontouchstart="event.preventDefault();
                  try{
                    fetch(document.getElementById('ip').value+'/control?var=car&val=5');
                  }
                  catch(e){}"                   
                  ontouchend="noStopControl();">[      後      ]</button></td>
                  
                  <td align="center"><button onmousedown="
                  try{
                    fetch(document.getElementById('ip').value+'/control?var=car&val=9');
                  }
                  catch(e){}"
                  onmouseup="noStopControl();" ontouchstart="event.preventDefault();
                  try{
                    fetch(document.getElementById('ip').value+'/control?var=car&val=9');
                  }
                  catch(e){}"                   
                  ontouchend="noStopControl();">[    右-後     ]</button></td>
                              
                  </tr>                   
                  
