FBTUG/FBTUG_MiniFarmBot/EDU/S4F/S4F.20200205.1/ESP32CAM_UDP_TTL0/app_httpd.cpp
      const enable = el => {
        el.classList.remove('disabled')
        el.disabled = false
      }
    
      const updateValue = (el, value, updateRemote) => {
        updateRemote = updateRemote == null ? true : updateRemote
        
      let initialValue
      
        if (el.type === 'checkbox') {
          initialValue = el.checked
          value = !!value
          el.checked = value
        } 
        else {
          initialValue = el.value
          el.value = value
        }
    
        if (updateRemote && initialValue !== value) {
          updateConfig(el);
        } 
        else if(!updateRemote){
          if(el.id === "aec"){
            value ? hide(exposure) : show(exposure)
          } 
          else if(el.id === "agc"){
            if (value) {
              show(gainCeiling)
              hide(agcGain)
            } 
            else {
              hide(gainCeiling)
              show(agcGain)
            }
          } 
          else if(el.id === "awb_gain"){
            value ? show(wb) : hide(wb)
          } 
          else if(el.id === "face_recognize"){
            value ? enable(enrollButton) : disable(enrollButton)
          }
        }
      }
    
      function updateConfig (el) {
        let value
        switch (el.type) {
          case 'checkbox':
            value = el.checked ? 1 : 0
            break
          case 'range':
          case 'select-one':
            value = el.value
            break
          case 'button':
          case 'submit':
            value = '1'
            break
          default:
            return
        }
    
        const query = `${baseHost}/control?var=${el.id}&val=${value}`
    
        fetch(query)
          .then(response => {
            console.log(`request to ${query} finished, status: ${response.status}`)
          })
      }
    
      document
        .querySelectorAll('.close')
        .forEach(el => {
          el.onclick = () => {
            hide(el.parentNode)
          }
        })
    
      // read initial values
      fetch(`${baseHost}/status`)
        .then(function (response) {
          return response.json()
        })
        .then(function (state) {
          document
            .querySelectorAll('.default-action')
            .forEach(el => {
              updateValue(el, state[el.id], false)
            })
        })
    
      const view = document.getElementById('stream')
      const viewContainer = document.getElementById('stream-container')
      const stillButton = document.getElementById('get-still')
      const streamButton = document.getElementById('toggle-stream')
      const enrollButton = document.getElementById('face_enroll')
      const closeButton = document.getElementById('close-stream')
    
      const stopStream = () => {
        window.stop();
        streamButton.innerHTML = '動態影像'
      }
    
      const startStream = () => {
        view.src = `${streamUrl}/stream`
        show(viewContainer)
        streamButton.innerHTML = '停止動態'
      }
    
      // Attach actions to buttons
      stillButton.onclick = () => {
        stopStream()
        view.src = `${baseHost}/capture?_cb=${Date.now()}`
        show(viewContainer)
      }
    
      closeButton.onclick = () => {
        stopStream()
        hide(viewContainer)
      }
    
      streamButton.onclick = () => {
        const streamEnabled = streamButton.innerHTML === '停止動態'
        if (streamEnabled) {
          stopStream()
        } 
        else {
          startStream()
        }
      }
    
      enrollButton.onclick = () => {
        updateConfig(enrollButton)
      }
    
      // Attach default on change action
      document
        .querySelectorAll('.default-action')
        .forEach(el => {
          el.onchange = () => updateConfig(el)
        })
    
      // Custom actions
      // Gain
      const agc = document.getElementById('agc')
      const agcGain = document.getElementById('agc_gain-group')
      const gainCeiling = document.getElementById('gainceiling-group')
      agc.onchange = () => {
        updateConfig(agc)
        if (agc.checked) {
          show(gainCeiling)
          hide(agcGain)
        } 
        else {
          hide(gainCeiling)
          show(agcGain)
        }
      }
    
      // Exposure
      const aec = document.getElementById('aec')
      const exposure = document.getElementById('aec_value-group')
      aec.onchange = () => {
        updateConfig(aec)
        aec.checked ? hide(exposure) : show(exposure)
      }
    
      // AWB
      const awb = document.getElementById('awb_gain')
      const wb = document.getElementById('wb_mode-group')
      awb.onchange = () => {
        updateConfig(awb)
        awb.checked ? show(wb) : hide(wb)
      }
    
      // Detection and framesize
      const detect = document.getElementById('face_detect')
      const recognize = document.getElementById('face_recognize')
      const framesize = document.getElementById('framesize')
    
      framesize.onchange = () => {
        updateConfig(framesize)
        if (framesize.value > 5) {
          updateValue(detect, false)
          updateValue(recognize, false)
        }
      }
    
      detect.onchange = () => {
        if (framesize.value > 5) {
          alert("Please select CIF or lower resolution before enabling this feature!");
          updateValue(detect, false)
          return;
        }
        updateConfig(detect)
        if (!detect.checked) {
          disable(enrollButton)
          updateValue(recognize, false)
        }
      }
    
      recognize.onchange = () => {
        if (framesize.value > 5) {
          alert("Please select CIF or lower resolution before enabling this feature!");
          updateValue(recognize, false)
          return;
        }
        updateConfig(recognize)
        if (recognize.checked) {
          enable(enrollButton)
          updateValue(detect, true)
        } else {
          disable(enrollButton)
        }
      }     
    })

    //---------------------------------------
    const noStopControl = () => {
      try{
        fetch(document.getElementById('ip').value + '/control?var=car&val=3');
      }
      catch(e){}
    }     
  </script>  
)rawliteral";

//---------------------------------------------------------------------------------------------
static esp_err_t index_handler(httpd_req_t *req){
    httpd_resp_set_type(req, "text/html");
    sensor_t * s = esp_camera_sensor_get();
    return httpd_resp_send(req, (const char *)INDEX_HTML, strlen(INDEX_HTML));
}

//---------------------------------------------------------------------------------------------
void startCameraServer(){
    httpd_config_t config = HTTPD_DEFAULT_CONFIG();

    httpd_uri_t index_uri = {
        .uri       = "/",
        .method    = HTTP_GET,
        .handler   = index_handler,
        .user_ctx  = NULL
    };

    httpd_uri_t status_uri = {
        .uri       = "/status",
        .method    = HTTP_GET,
        .handler   = status_handler,
        .user_ctx  = NULL
    };

    httpd_uri_t cmd_uri = {
        .uri       = "/control",
        .method    = HTTP_GET,
        .handler   = cmd_handler,
        .user_ctx  = NULL
    };

    httpd_uri_t capture_uri = {
        .uri       = "/capture",
        .method    = HTTP_GET,
        .handler   = capture_handler,
        .user_ctx  = NULL
    };

